#  Encoding categorical variables

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('dataset 1.csv')

In [3]:
df.head()

  Policy no.  age     sex     bmi  charges in INR
0  PLC156898   19  female  27.900     16884.92400
1  PLC156907   18    male  33.770      1725.55230
2  PLC156916   28    male  33.000      4449.46200
3  PLC156925   33    male  22.705     21984.47061
4  PLC156934   32    male  28.880      3866.85520

##  Label encoding

In [4]:
from sklearn.preprocessing import LabelEncoder

In [5]:
le=LabelEncoder()  #object creation from a class variable

In [6]:
df['sex_le']=le.fit_transform(df['sex'])

In [7]:
df.head()

  Policy no.  age     sex     bmi  charges in INR  sex_le
0  PLC156898   19  female  27.900     16884.92400       0
1  PLC156907   18    male  33.770      1725.55230       1
2  PLC156916   28    male  33.000      4449.46200       1
3  PLC156925   33    male  22.705     21984.47061       1
4  PLC156934   32    male  28.880      3866.85520       1

In [8]:
df.tail()

     Policy no.  age     sex    bmi  charges in INR  sex_le
1334  PLC168904   18  female  31.92       2205.9808       0
1335  PLC168913   18  female  36.85       1629.8335       0
1336  PLC168922   21  female  25.80       2007.9450       0
1337  PLC168931   61  female  29.07      29141.3603       0
1338  PLC168935   36     NaN    NaN      32343.5600       2

In [9]:
df['sex_le'].value_counts()

1    676
0    662
2      1
Name: sex_le, dtype: int64

In [10]:
df['sex'].value_counts()

male      676
female    662
Name: sex, dtype: int64

##  Ordinal Encoder

In [11]:
from sklearn.preprocessing import OrdinalEncoder

In [12]:
df.dropna(inplace=True)

In [13]:
df.tail()

     Policy no.  age     sex    bmi  charges in INR  sex_le
1333  PLC168895   50    male  30.97      10600.5483       1
1334  PLC168904   18  female  31.92       2205.9808       0
1335  PLC168913   18  female  36.85       1629.8335       0
1336  PLC168922   21  female  25.80       2007.9450       0
1337  PLC168931   61  female  29.07      29141.3603       0

In [14]:
df.isna().sum()

Policy no.        0
age               0
sex               0
bmi               0
charges in INR    0
sex_le            0
dtype: int64

In [15]:
oe=OrdinalEncoder()

In [16]:
df['sex_oe']=oe.fit_transform(df[['sex']])

In [23]:
df['sex']

0       female
1         male
2         male
3         male
4         male
         ...
1333      male
1334    female
1335    female
1336    female
1337    female
Name: sex, Length: 1338, dtype: object

In [17]:
df[['sex']]

         sex
0     female
1       male
2       male
3       male
4       male
...      ...
1333    male
1334  female
1335  female
1336  female
1337  female

[1338 rows x 1 columns]

In [18]:
df.head()

  Policy no.  age     sex     bmi  charges in INR  sex_le  sex_oe
0  PLC156898   19  female  27.900     16884.92400       0     0.0
1  PLC156907   18    male  33.770      1725.55230       1     1.0
2  PLC156916   28    male  33.000      4449.46200       1     1.0
3  PLC156925   33    male  22.705     21984.47061       1     1.0
4  PLC156934   32    male  28.880      3866.85520       1     1.0

#### find differnce btm one hot and label encoding

## One Hot Encoder

In [19]:
ohe=pd.get_dummies(df['sex'])

In [24]:
ohe

      female  male
0          1     0
1          0     1
2          0     1
3          0     1
4          0     1
...      ...   ...
1333       0     1
1334       1     0
1335       1     0
1336       1     0
1337       1     0

[1338 rows x 2 columns]

In [21]:
df[['female_ohe','male_ohe']]=ohe

In [22]:
df.head()

,Policy no.,age,sex,bmi,charges in INR,sex_le,sex_oe,female_ohe,male_ohe
0,PLC156898,19,female,27.900,16884.92400,0,0.0,1,0
1,PLC156907,18,male,33.770,1725.55230,1,1.0,0,1
2,PLC156916,28,male,33.000,4449.46200,1,1.0,0,1
3,PLC156925,33,male,22.705,21984.47061,1,1.0,0,1
4,PLC156934,32,male,28.880,3866.85520,1,1.0,0,1